import "../styles/SettingsTerms.css";
import termsTableImg from "../assets/SVG_Main/terms.png";

const SettingsTerms = () => {
  const privacyText = `Pres.은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고
있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이
변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등
필요한 조치를 이행할 예정입니다.

1. 회원 가입 및 관리
회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증,
회원자격 유지·관리, 서비스 부정이용 방지, 만 14세 미만 아동의
개인정보 처리 시 법정대리인의 동의 여부 확인, 각종 고지·통지,
고충처리 목적으로 개인정보를 처리합니다.

2. 재화 또는 서비스 제공
서비스 제공, 이메일 발송, 콘텐츠 제공,
맞춤서비스 제공, 본인인증의 목적으로 개인정보를 처리합니다.
`;
  const termsText = `제 5 조 (이용계약의 성립)
1. 이용계약은 이용자가 온라인으로 서비스에서 제공하는 소정의 가입신청 양식에서 요구하는 사항을 기록하여 가입을 완료하는 것으로 성립됩니다.
2. 서비스는 다음 각 호에 해당하는 이용계약에 대하여는 가입을 취소할 수 있습니다.
1) 다른 사람의 명의를 사용하여 신청하였을 때
2) 이용계약 신청서의 내용을 허위로 기재하였거나 신청하였을 때
3) 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등의 행위를 하였을 때
4) 서비스를 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우
5) 기타 서비스가 정한 이용신청요건이 미비 되었을 때
제 6 조 (회원정보 사용에 대한 동의)
1. 회원의 개인정보는 「공공기관의개인정보보호에관한법률」에 의해 보호됩니다.
2. 서비스의 회원 정보는 다음과 같이 사용, 관리, 보호됩니다.
1) 개인정보의 사용 : 서비스는 서비스 제공과 관련해서 수집된 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.
단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우 또는 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우, 이용자 스스로 개인정보를 공개한 경우에는 그러하지 않습니다.
2) 개인정보의 관리 : 회원은 개인정보의 보호 및 관리를 위하여 서비스의 개인정보관리에서 수시로 회원의 개인정보를 수정·삭제할 수 있습니다.
3) 개인정보의 보호 : 회원의 개인정보는 오직 본인만이 열람·수정·삭제 할 수 있으며, 이는 전적으로 회원의 계정과 비밀번호에 의해 관리되고 있습니다.
따라서 타인에게 본인의 계정과 비밀번호를 알려주어서는 안되며, 작업 종료시에는 반드시 로그아웃해 주시기 바랍니다.
3. 회원이 본 약관에 따라 이용신청을 하는 것은, 서비스 신청서에 기재된 회원정보를 수집, 이용하는 것에 동의하는 것으로 간주됩니다.
제 7 조 (사용자의 정보 보안)
1. 이용자는 서비스 가입 절차를 완료하는 순간부터 본인이 입력한 정보의 비밀을 유지할 책임이 있으며,
회원이 고의나 중대한 실수로 회원의 계정과 비밀번호를 사용하여 발생한 피해에 대한 책임은 회원 본인에게 있습니다.
2. 계정과 비밀번호에 관한 모든 관리의 책임은 회원에게 있으며,
회원의 계정이나 비밀번호가 부정하게 사용되었다는 사실을 발견한 경우에는 즉시 서비스에 신고하여야 합니다.
신고를 하지 않음으로 인한 모든 책임은 회원 본인에게 있습니다.
3. 이용자는 서비스의 사용 종료시마다 정확히 접속을 종료해야 하며,
정확히 종료하지 아니함으로써 제3자가 이용자에 관한 정보를 이용하게 되는 등의 결과로 인해 발생하는 손해 및 손실에 대하여
서비스는 책임을 부담하지 아니합니다.
제 8 조 (서비스의 변경)
1. 당 사이트는 귀하가 서비스를 이용하여 기대하는 손익이나 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않으며,
회원이 본 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관하여는 책임을 지지 않습니다.
2. 당 사이트는 서비스 이용과 관련하여 가입자에게 발생한 손해 중 가입자의 고의, 과실에 의한 손해에 대하여 책임을 부담하지 아니합니다.
제 9 조 (이용기간 및 자격의 정지 및 상실)
1. 서비스 회원이용기간은 조직통폐합에 따른 불가항력을 제외하고 회원신청에서 탈퇴까지로 합니다.
2. 서비스는 이용자가 본 약관에 명시된 내용을 위배하는 행동을 한 경우,
이용자격을 일시적으로 정지하고 30일 이내에 시정하도록 이용자에게 요구할 수 있으며,
이후 동일한 행위를 2회 이상 반복할 경우에 30일간의 소명기회를 부여한 후 이용자격을 상실시킬 수 있습니다.
3. 서비스의 회원이 신청 후 12개월 이상 장시간 이용하지 않은 회원은 휴면아이디로 분류하여,
자격 정지 및 상실이 가능합니다.
제 10 조 (계약해제, 해지 등)
1. 회원은 언제든지 서비스 초기화면의 마이페이지 또는 정보수정 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있으며,
서비스는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
2. 회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 회원정보를 보유하는 경우를 제외하고는
해지 즉시 회원의 모든 데이터는 소멸됩니다.
3. 회원이 계약을 해지하는 경우, 회원이 작성한 게시물 중 블로그 등과 같이 본인 계정에 등록된 게시물 일체는 삭제됩니다.
단, 타인에 의해 스크랩 되어 재게시되거나, 공용게시판에 등록된 게시물 등은 삭제되지 않으니
사전에 삭제 후 탈퇴하시기 바랍니다.
제 11 조 (게시물의 저작권)
1. 이용자가 게시한 게시물의 저작권은 이용자가 소유하며, 서비스 내에 이를 게시할 수 있는 권리를 갖습니다.
2. 서비스는 다음 각 호에 해당하는 게시물이나 자료를 사전통지 없이 삭제하거나 이동 또는 등록 거부를 할 수 있습니다.
1) 본 서비스 약관에 위배되거나 상용 또는 불법, 음란, 저속하다고 판단되는 게시물을 게시한 경우
2) 다른 회원 또는 제3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우
3) 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우
4) 불법복제 또는 해킹을 조장하는 내용인 경우
5) 영리를 목적으로 하는 광고일 경우
6) 범죄와 결부된다고 객관적으로 인정되는 내용일 경우
7) 다른 이용자 또는 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
8) 서비스에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우
9) 기타 관계법령에 위배된다고 판단되는 경우
3. 이용자의 게시물이 타인의 저작권을 침해함으로써 발생하는 민·형사상의 책임은 전적으로 이용자가 부담하여야 합니다.
`;

  return (
    <div className="SettingsTerms">
      {/* 개인정보 처리방침 */}
      <div className="SettingsTerms__block">
        <h2 className="Settings__section-title">개인정보 처리방침</h2>
        <h3 className="Settings__label">개인정보의 처리목적</h3>

        <p className="SettingsTerms__text" style={{ whiteSpace: "pre-wrap" }}>
          {privacyText}
        </p>

        <div className="SettingsTerms__table">
          <img src={termsTableImg} alt="개인정보 수집 항목 표" />
        </div>
      </div>

      {/* 이용약관 */}
      <div className="SettingsTerms__block">
        <h2 className="Settings__section-title">이용 약관</h2>
        <h3 className="Settings__label">서비스 제공 및 이용</h3>
        <p className="SettingsTerms__text" style={{ whiteSpace: "pre-wrap" }}>
          {termsText}
        </p>

        <div className="SettingsTerms__table">
          <img src={termsTableImg} alt="개인정보 수집 항목 표" />
        </div>
      </div>
    </div>
  );
};

export default SettingsTerms;
